Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладе</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РеализацияТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена)
					// Вставити вміст обробника.
	//а = Номен; 		// Вносим в переменную название номенклатуры, которое передали в процедуру
	//Цена = а.Цена; 	// Подтягиваем цена связанную с этой номенклатурой
	
	Данные = РегистрыСведений.ЦеныТоваров.СрезПоследних(Объект.Дата - 1, Отбор);
	Если Данные.Количество()=0 тогда
		Возврат;
	Конецесли;
	Цена = Данные[0].Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Номен = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипЦены", Объект.ТипЦены);
	Отбор.Вставить("Номенклатура", Номен);
	
	
															// Вносим в переменную текущее значение номенклатуры
	Цена = 0;                                          		 // Обнуляем цену, чтоб не передавать НУЛЛ
	ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена);	// Вызываем процедуру на сервере
	Элементы.Товары.ТекущиеДанные.Цена = Цена;            	// Вносим цену в табличную часть
	ТоварыЦенаПриИзменении(Элемент);                      	// Вызываем процедуру пересчета
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьСумму(Элементы.Товары.ТекущиеДанные); // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ОбработкаТабличныхЧастей.ПересчитатьЦену(Элементы.Товары.ТекущиеДанные);  // Вызываем процедуру пересчета цены
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // Перенос Итога по полю "Сумма" в "СуммуДокумента"
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") // При Окончании редактирования табличной части изменяем реквизит документа "Сумма Документа"
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	// Вставити вміст обробника.
	МоиКурс = МодульВалютногоУчета.ПолучитьКурсВалют(Объект.Валюта, Объект.Дата);
		Объект.КурсВзаиморасчетов = МоиКурс.Курс;
		Объект.КратностьВзаиморасчетов = МоиКурс.Кратность;
	

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПриИзменении(Элемент)
	Для каждого стр из Объект.Товары цикл
		//Номен = Элементы.Товары.ТекущиеДанные.Номенклатура;
		Отбор = Новый Структура;
		Отбор.Вставить("ТипЦены", Объект.ТипЦены);
		Отбор.Вставить("Номенклатура", стр.Номенклатура);
														// Вносим в переменную текущее значение номенклатуры
		Цена = 0;                                          		 // Обнуляем цену, чтоб не передавать НУЛЛ
		ТоварыНоменклатураПриИзмененииНаСервере(Отбор, Цена);	// Вызываем процедуру на сервере
		стр.Цена = Цена;
		ОбработкаТабличныхЧастей.ПересчитатьСумму(стр);
		
	конеццикла;
КонецПроцедуры
